#include <stdio.h>

int main() {
    printf("Hello, World!\n");
//    /Users/bojanangjeleski/CLionProjects/untitled141/input.txt
    return 0;
}


/*
    Во датотеката input.txt е сместена матрица од цели броеви (0 < m, n < 50). Во првиот ред се запишани димензиите за матрицата.Во следните редови се
    запишани елементите од матрицата по редици (види пример).
    Нека со S1 е означен збирот на елементите што се наогаат десно од даден елемент вклучувајќи го и него и нека со S2 е означен збирот на елементите што се
    наогаат по даден елемент вклучувајќи го и него.
    Потребно е да се трансформира матрица така што секој елемент ќе се замени со поголемата од двете вредности S1 & S2. По направената трансформација,
    матрицата треба да се испечати на стандарден излез.
    Со цел да добиете 100% од поените, потребно е да не користите дополнителна матрица.

    Пример:
    Влез
    3 4
    1 2 3 4
    5 6 4 8
    9 10 0 12
    За елементот на позиција 0 1 (елементот со вредност 2), S1 = (2 + 3 + 4) = 9, S2 = (2 + 6 + 10) = 18. Елементот се заменува со вредноста 18 затоа што во
    Излез
    15 18 7 24
    23 18 12 20
    31 22 12 12
*/